
## Plan Result

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3121817941)


<pre><code>Plan: 4 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * aws_lb.memo_board
  * aws_lb_listener.memo_board_rs
  * aws_lb_target_group.memo_board_rs
  * aws_security_group.memo_board_lb
* Update
  * aws_internet_gateway.memo_board
  * aws_route_table.public
  * aws_subnet.memo_board_1
  * aws_subnet.memo_board_2
  * aws_subnet.memo_board_3
  * aws_vpc.memo_board


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_internet_gateway.memo_board will be updated in-place
  ~ resource "aws_internet_gateway" "memo_board" {
        id       = "igw-0310af73c3aeaf62f"
      ~ tags     = {
          + "Name" = "memo_board"
        }
      ~ tags_all = {
          + "Name" = "memo_board"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_lb.memo_board will be created
  + resource "aws_lb" "memo_board" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 30
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "memo-board"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-047a19359c4468354",
          + "subnet-0ae15c749b9813fb9",
          + "subnet-0f84ebfae4c920a30",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.memo_board_rs will be created
  + resource "aws_lb_listener" "memo_board_rs" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-northeast-1:281036478087:certificate/305d7a9c-79cb-4f67-9738-211c0932f202"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.memo_board_rs will be created
  + resource "aws_lb_target_group" "memo_board_rs" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "memo-board-rs"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-07dac755b05cdc5e5"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_route_table.public will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-065eee68b235bf30b"
      ~ tags             = {
          + "Name" = "memo_board"
        }
      ~ tags_all         = {
          + "Name" = "memo_board"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.memo_board_lb will be created
  + resource "aws_security_group" "memo_board_lb" {
      + arn                    = (known after apply)
      + description            = "For load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
        ]
      + name                   = "memo_board_lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-07dac755b05cdc5e5"
    }

  # aws_subnet.memo_board_1 will be updated in-place
  ~ resource "aws_subnet" "memo_board_1" {
        id                                             = "subnet-047a19359c4468354"
      ~ tags                                           = {
          + "Name" = "memo_board_1"
        }
      ~ tags_all                                       = {
          + "Name" = "memo_board_1"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.memo_board_2 will be updated in-place
  ~ resource "aws_subnet" "memo_board_2" {
        id                                             = "subnet-0ae15c749b9813fb9"
      ~ tags                                           = {
          + "Name" = "memo_board_2"
        }
      ~ tags_all                                       = {
          + "Name" = "memo_board_2"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.memo_board_3 will be updated in-place
  ~ resource "aws_subnet" "memo_board_3" {
        id                                             = "subnet-0f84ebfae4c920a30"
      ~ tags                                           = {
          + "Name" = "memo_board_3"
        }
      ~ tags_all                                       = {
          + "Name" = "memo_board_3"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc.memo_board will be updated in-place
  ~ resource "aws_vpc" "memo_board" {
        id                               = "vpc-07dac755b05cdc5e5"
      ~ tags                             = {
          + "Name" = "memo_board"
        }
      ~ tags_all                         = {
          + "Name" = "memo_board"
        }
        # (15 unchanged attributes hidden)
    }

Plan: 4 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":20,"Program":"tfcmt","SHA1":"585850354576d8b31df3fe6320ba0ab50e39030e","Vars":{},"WorkflowName":"Terraform"} -->